#include <iostream>

#define юзай using
#define слова namespace
#define гопника std
#define блять ;
#define нихуя int
#define началось main()
#define типа {
#define ёба }
#define гопник setlocale(LC_ALL, "Russian")
#define числа double
#define базар char
#define базарь cout<<
#define пиздец <<endl
#define спроси cin>>
#define если if(
#define сука ==
#define крест '+'
#define то )
#define это =
#define плюс +
#define нахуй ;
#define иначе else
#define черта '-'
#define минус -
#define жопа '*'
#define ю *
#define слэш '/'
#define на /
#define засунь <<
#define стопэ return 0

юзай слова гопника блять

нихуя началось
типа
гопник блять
числа первое, второе, результат блять
базар знак блять
базарь "Гони цифры" пиздец блять
спроси первое блять
спроси второе блять
базарь "И че мне с ними делать?" пиздец блять
спроси знак блять
если знак сука крест то результат это первое плюс второе нахуй
иначе если знак сука черта то результат это первое минус второе нахуй
иначе если знак сука жопа то результат это первое ю второе нахуй
иначе если знак сука слэш то результат это первое на второе нахуй
базарь результат засунь " нахуй" пиздец блять
стопэ блять
ёба